from fastapi import FastAPI

app = FastAPI()

@app.get("/national_id/{id}")
def national_id(id: str):
    if len(id) != 10 or not id.isdigit():
        return "کد ملی باید دقیقاً ۱۰ عدد باشد"

    check = int(id[9])
    sum = 0
    for i in range(9):
        sum += int(id[i]) * (10 - i)
    c = sum % 11

    if c < 2 and check == c or c >= 2 and check == 11 - c:
        return "کد ملی معتبر است"
    else:
        return "کد ملی معتبر نیست"

# هر رقم را ضربدر موقعیتش کنید و پاسخ ها را با هم جمع ببندید. (طبق تصویر فوق: مجموع هر رقم * موقعیت)
# حاصل مجموع را بر 11 تقسیم کنید.(11/مجموع هر رقم * موقعیت)
# باقیمانده را بررسی کنید اگر بالاتر از دو بود 11 منهای باقیمانده همان عدد کنترلی مد نظر شماست و اگر کمتر از عدد 2 بود عدد کنترلی همان باقیمانده می باشد :
# باقیمانده از 2 کمتر بود => رقم کنترل = باقیمانده
# اگر باقیمانده بیشتر از 2 بود => رقم کنترل= باقیمانده – 11