from fastapi import FastAPI

app = FastAPI()


@app.get("/Birthprovince/{center}")
def Birthprovince(center: str):
    markaz = ["مرکزی", "لرستان", "تهران", "اردبیل", "آذربایجان شرقی", "اصفهان", "خوزستان", "ایلام", "خراسان شمالی", "خراسان جنوبی"
         , "خراسان رضوی", "هرمزگان", "بوشهر", "آذربایجان غربی", "گیلان", "سیستان و بلوچستان", "زنجان", "ساری", "سمنان", "کردستان",
         "فارس", "چهارمحال و بختیاری", "قزوین", "قم", "البرز", "کرمان", "کرمانشاه", "گلستان", "همدان", "کهکیلویه و بویراحد", "یزد"]
    if center in markaz:
        return f"استان وارد شده معتبر است"
    else:
        return f"استان وارد شده در لیست استان های ایران نیست یا ورودی به صورت اشتباه وارد شده است"
