import pycountry as py
from fastapi import FastAPI

app = FastAPI()

# 1
@app.get("/birth_place/{shahr}")
def birth_place(shahr: str):
    iran_subdivisions = list(py.subdivisions.get(country_code='IR'))

    iran_cities = [subdivision.name for subdivision in iran_subdivisions]

    if shahr in iran_cities:
        return f"شهرستان وارد شده معتبر است"
    else:
        return f"شهرستان وارد شده در لیست شهرستان های ایران نیست یا ورودی به صورت اشتباه وارد شده است"

# مثال ورودی: 'Būshehr'


# 2
@app.get("/birthplace/{city}")
def birthplace(city: str):
    c = ["همدان","ملایر","نهاوند","لالجین","تویسرکان","اسد آباد","کبودرآهنگ","فرسفج","سامن","قزوین","ابهر","تاکستان"
        ,"بوئین زهرا","ابگرم","قزوین","گرگان","بندرترکمن","کلاله","علی آباد کتول","گنبد کاووس","رامیان","مینودشت","گالیکش",
         "آزادشهر","مرواه تپه","کردکوی","شیراز","جهرم","سپیدان","لار","فسا","ارسنجان","مرودشت","سروستان","اقلید","داراب","قیر",
         "سپیدان","کازرون","استهبان","آباده","فیروزکوه","نی ریز","خنج","گراش","کوار","مهر","سوریان","اواز","جویم","اهواز",
         "شوشتر","آبادان","ایذه","دزفول","مسجد سلیمان","بندر ماهشهر","بهبهان","خرمشهر","اندیمشک","رامهرمز","بنر امام خمینی",
         "قیدار","قلعه تل","هنیجان","شادگان","دهدز","شوش","جزیره بونه","جزیره دارا","لالی","هویزه","امیدیه","بیشه بزان","بندراروند کنار",
         "پادگان دوکوهه","تبریز","جلفا","مرند","لیقوان","لیلان","کلیبر","بناب","مراغه","سراب","عجب شیر","اسکو","شبستر","کندوان","سردرود",
         "میانه","ورزقان","هشترود","اهر","نقده","بستان آباد","مشهد","سبزوار","نیشابور","اخلمد","اسفدن","کنگ","قوچان","چناران","شیروان",
         "شاندیز","تربت حیدریه","تربت جام","قدمگاه","توس","رشتخوار","سرخس","گناباد","کاشمر","بجستان","خواف","قاین","کلات نادری","فریمان",
         "طرقبه","ریزه","نشتیفان","بردستان","باخرز","درگز","بردسکن","خرگرد","تایباد","شهرکرد","بن","اردل","لردگان","بروجن","کوهرنگ",
         "فارسان","هفشجان","سامان","یزد","بافق","اردکان","میبد","تفت","مهریز","ابرکوه","رضوانشهر","خرانق","ندوشن","اشکذر",
         "سمنان","دامغان","میامی","شاهرود","سرخه","گرمسار","مهدی شهر","شهمیرزاد","بسطام","قلعه نوخرقان","بجنورد",
         "جاجرم","گرمه","اسفراین","فاروج","اسپاخو","صفی آباد","آشخانه","شوقان","زنجان","طارم","خرم دره","سلطانیه",
         "اب بر","خدابنده","ماهنشان","زرین رود","زرین آباد","زاهدان","چابهار","خاش","ایرانشهر","زابل","کنارک","زهک",
         "میرجاوه","سراوان","نیک شهر","بمپور","بزمان","سرباز","بوشهر","برازجان","عسلویه","خارک","بندر سیراف","سعدآباد",
         "گناوه","سجادیه","جزیره عباسک","خورموج","جزیره چراغی","دلوار","جزیره تهمادو","اهرم","کرمان","بم","راین","رفسنجان",
         "میمند","سیرجان","ماهان","فهرج","کوهبنان","کهنوج","جوپار","منوجان","راور","انار","بردسیر","شهر بابک","جیرفت","یاسوج",
         "چرام","سی سخت","باشت","گچساران","لیکک","دیشموک","دهدشت","پاتاوه","تهران","ورامین","لواسان","دماوند",
         "فیروزکوه","اسلامشهر","سولقان","دربندسر","رباط کریم","رودبار قصران","کرج","طالقان","هشتگرد","کردان","نظرآباد",
         "شهرستانک","سرعین","اردبیل","مشگین شهر","خلخال","نیر","پارس آباد","گرمی","عنبران","رضی","نمین","بیله سوار","اصفهان",
         "کاشان","گلپایگان","نائین","خوانسار","ابیانه","شهرضا","خور و بیابانک","مبارکه","سمیرم","خمینی شهر","خور","شاهین شهر",
         "آران و بیدگل","فریدون شهر","اردستان","نطنز","زواره","بیاضه","نجف آباد","میمه","ورزنه","زرین شهر","بندرانزلی","رشت",
         "منجیل","لاهیجان","تالش","رودبار","لنگرود","املش","آستارا","اسالم","رودسر","ماسال","چابکسر","فومن","آستانه اشرفیه",
         "ماسوله","لوندویل","بره سر","صومعه سرا","کیاشهر","شفت","لوشان","سیاهکل","دیلمان","داماش","پره سر""نوشهر","رامسر",
         "تنکابن","چالوس","قائمشهر","مرزن آباد","نمک آبرود","محمودآباد","بابلسر","کلاردشت","نور","ساریسوادکوه","کتالم","بابل","آمل",
         "سلمان شهر","عباس آباد","بهشهر","لاریجان","کتالم","فریدون کنار","بلده","کتالم","گلوگاه","الاشت","شیرگاه","بلده","سیاه بیشه",
         "ایزدشهر","پل سفید","جنت رودبار","رستمکلا","ایلام","چرداول","دهلران","سراب کلان","سیروان","دره شهر","مهران","آبدانان","ایوان",
         "ارومیه","خوی","پیرانشهر","مهاباد","سلماس","تکاب","بوکان","ماکو","میاندوآب","سیه چشمه","سردشت","بیرجند","فردوس","طبس","نهبندان",
         "درمیان","اسدیه","سربیشه","بشرویه","سرایان","خوسف","چنسف","خضری","دشت بیاض","اراک","محلات","ساوه","دلیجان","تفرش","خمین","شازند",
         "نراق","گورچان","بانه","دیواندره","مریوان","کامیاران","سقز","اوراما","سنندج","قروه","بیجار","کیش","قشم","میناب","جزیره هرمز",
         "بندرعباس","بندر لنگه","جزیره هنگام","جزیره ابوموسی","جزیره شیدور","بستک","بندر دیلم","بندر کنگ","حاجی آباد","کرمانشاه","بیستون",
         "پاوه","سرپل ذهاب","کنگاور","جوانرود","سنقر","قصر شیرین","گیلانغرب","کرند غرب","کل کل","صحنه","اسلام آباد غرب","کوزران","دالاهو","هرسین",
         "روانسر","خرم آباد","پل دختر","الیگودرز","ازنا","بروجرد","دورود","کوهدشت","قم","سلفچگان","کهک",]

    if city in c:
        return f"شهرستان وارد شده معتبر است"
    else:
        return f"شهرستان وارد شده در لیست شهرستان های ایران نیست یا ورودی به صورت اشتباه وارد شده است"


